Repository: Lukas0907/wtforms
Catalog: src/wtforms/locale/*/LC_MESSAGES/wtforms.po
Languages: ta

source: Invalid field name '%s'.
ta: தவறான புலம் பெயர் '%s'.

source: Field must be equal to %(other_name)s.
ta: புலம் %(பிற_ பெயர்) கள் சமமாக இருக்க வேண்டும்.

source: Field must be at least %(min)d character long.
ta: புலம் குறைந்தது %(நிமிடம்) டி எழுத்துக்குறி நீளமாக இருக்க வேண்டும்.

source: Field cannot be longer than %(max)d character.
ta: புலம் %(அதிகபட்சம்) டி எழுத்தை விட நீளமாக இருக்க முடியாது.

source: Field must be exactly %(max)d character long.
ta: புலம் சரியாக %(அதிகபட்சம்) டி எழுத்து நீளமாக இருக்க வேண்டும்.

source: Field must be between %(min)d and %(max)d characters long.
ta: புலம் %(நிமிடம்) டி மற்றும் %(அதிகபட்சம்) டி எழுத்துக்களுக்கு இடையில் இருக்க வேண்டும்.

source: Number must be at least %(min)s.
ta: எண் குறைந்தது %(நிமிடம்) கள் இருக்க வேண்டும்.

source: Number must be at most %(max)s.
ta: எண் அதிகபட்சம் %(அதிகபட்சம்) கள் இருக்க வேண்டும்.

source: Number must be between %(min)s and %(max)s.
ta: எண் %(நிமிடம்) கள் மற்றும் %(அதிகபட்சம்) கள் இடையே இருக்க வேண்டும்.

source: This field is required.
ta: இந்த புலம் தேவை.

source: Invalid input.
ta: தவறான உள்ளீடு.

source: Invalid email address.
ta: தவறான மின்னஞ்சல் முகவரி.

source: Invalid IP address.
ta: தவறான ஐபி முகவரி.

source: Invalid Mac address.
ta: தவறான MAC முகவரி.

source: Invalid URL.
ta: தவறான முகவரி.

source: Invalid UUID.
ta: தவறான UUID.

source: Invalid value, must be one of: %(values)s.
ta: தவறான மதிப்பு, அவற்றில் ஒன்றாக இருக்க வேண்டும்: %(மதிப்புகள்) கள்.

source: Invalid value, can't be any of: %(values)s.
ta: தவறான மதிப்பு, எதுவும் இருக்க முடியாது: %(மதிப்புகள்) கள்.

source: This field cannot be edited.
ta: இந்த புலத்தைத் திருத்த முடியாது.

source: This field is disabled and cannot have a value.
ta: இந்த புலம் முடக்கப்பட்டுள்ளது மற்றும் மதிப்பு இருக்க முடியாது.

source: Invalid CSRF Token.
ta: தவறான சி.எச்.ஆர்.எஃப் கிள்ளாக்கு.

source: CSRF token missing.
ta: சி.எச்.ஆர்.எஃப் கிள்ளாக்கு இல்லை.

source: CSRF failed.
ta: சி.எச்.ஆர்.எஃப் தோல்வியடைந்தது.

source: CSRF token expired.
ta: சி.எச்.ஆர்.எஃப் கிள்ளாக்கு காலாவதியானது.

source: Invalid Choice: could not coerce.
ta: தவறான தேர்வு: கட்டாயப்படுத்த முடியவில்லை.

source: Choices cannot be None.
ta: தேர்வுகள் எதுவும் இருக்க முடியாது.

source: Not a valid choice.
ta: சரியான தேர்வு அல்ல.

source: Invalid choice(s): one or more data inputs could not be coerced.
ta: தவறான தேர்வு (கள்): ஒன்று அல்லது அதற்கு மேற்பட்ட தரவு உள்ளீடுகளை கட்டாயப்படுத்த முடியவில்லை.

source: '%(value)s' is not a valid choice for this field.
ta: '%(மதிப்பு) கள்' இந்த புலத்திற்கு சரியான தேர்வு அல்ல.

source: Not a valid datetime value.
ta: சரியான தேதிநேர மதிப்பு அல்ல.

source: Not a valid date value.
ta: சரியான தேதி மதிப்பு அல்ல.

source: Not a valid time value.
ta: சரியான நேர மதிப்பு அல்ல.

source: Not a valid week value.
ta: சரியான வார மதிப்பு அல்ல.

source: Not a valid integer value.
ta: செல்லுபடியாகும் முழு மதிப்பு அல்ல.

source: Not a valid decimal value.
ta: செல்லுபடியாகும் தசம மதிப்பு அல்ல.

source: Not a valid float value.
ta: செல்லுபடியாகும் மிதவை மதிப்பு அல்ல.
